----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 55, 55]          23,296
              ReLU-2           [-1, 64, 55, 55]               0
         MaxPool2d-3           [-1, 64, 27, 27]               0
            Conv2d-4          [-1, 192, 27, 27]         307,392
              ReLU-5          [-1, 192, 27, 27]               0
         MaxPool2d-6          [-1, 192, 13, 13]               0
            Conv2d-7          [-1, 384, 13, 13]         663,936
              ReLU-8          [-1, 384, 13, 13]               0
            Conv2d-9          [-1, 256, 13, 13]         884,992
             ReLU-10          [-1, 256, 13, 13]               0
           Conv2d-11          [-1, 256, 13, 13]         590,080
             ReLU-12          [-1, 256, 13, 13]               0
        MaxPool2d-13            [-1, 256, 6, 6]               0
AdaptiveAvgPool2d-14            [-1, 256, 6, 6]               0
          Dropout-15                 [-1, 9216]               0
           Linear-16                 [-1, 4096]      37,752,832
             ReLU-17                 [-1, 4096]               0
          Dropout-18                 [-1, 4096]               0
           Linear-19                 [-1, 4096]      16,781,312
             ReLU-20                 [-1, 4096]               0
           Linear-21                 [-1, 1000]       4,097,000
================================================================
Total params: 61,100,840
Trainable params: 61,100,840
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 8.38
Params size (MB): 233.08
Estimated Total Size (MB): 242.03
----------------------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 224, 224]           1,792
              ReLU-2         [-1, 64, 224, 224]               0
            Conv2d-3         [-1, 64, 224, 224]          36,928
              ReLU-4         [-1, 64, 224, 224]               0
         MaxPool2d-5         [-1, 64, 112, 112]               0
            Conv2d-6        [-1, 128, 112, 112]          73,856
              ReLU-7        [-1, 128, 112, 112]               0
            Conv2d-8        [-1, 128, 112, 112]         147,584
              ReLU-9        [-1, 128, 112, 112]               0
        MaxPool2d-10          [-1, 128, 56, 56]               0
           Conv2d-11          [-1, 256, 56, 56]         295,168
             ReLU-12          [-1, 256, 56, 56]               0
           Conv2d-13          [-1, 256, 56, 56]         590,080
             ReLU-14          [-1, 256, 56, 56]               0
           Conv2d-15          [-1, 256, 56, 56]         590,080
             ReLU-16          [-1, 256, 56, 56]               0
           Conv2d-17          [-1, 256, 56, 56]         590,080
             ReLU-18          [-1, 256, 56, 56]               0
        MaxPool2d-19          [-1, 256, 28, 28]               0
           Conv2d-20          [-1, 512, 28, 28]       1,180,160
             ReLU-21          [-1, 512, 28, 28]               0
           Conv2d-22          [-1, 512, 28, 28]       2,359,808
             ReLU-23          [-1, 512, 28, 28]               0
           Conv2d-24          [-1, 512, 28, 28]       2,359,808
             ReLU-25          [-1, 512, 28, 28]               0
           Conv2d-26          [-1, 512, 28, 28]       2,359,808
             ReLU-27          [-1, 512, 28, 28]               0
        MaxPool2d-28          [-1, 512, 14, 14]               0
           Conv2d-29          [-1, 512, 14, 14]       2,359,808
             ReLU-30          [-1, 512, 14, 14]               0
           Conv2d-31          [-1, 512, 14, 14]       2,359,808
             ReLU-32          [-1, 512, 14, 14]               0
           Conv2d-33          [-1, 512, 14, 14]       2,359,808
             ReLU-34          [-1, 512, 14, 14]               0
           Conv2d-35          [-1, 512, 14, 14]       2,359,808
             ReLU-36          [-1, 512, 14, 14]               0
        MaxPool2d-37            [-1, 512, 7, 7]               0
AdaptiveAvgPool2d-38            [-1, 512, 7, 7]               0
           Linear-39                 [-1, 4096]     102,764,544
             ReLU-40                 [-1, 4096]               0
          Dropout-41                 [-1, 4096]               0
           Linear-42                 [-1, 4096]      16,781,312
             ReLU-43                 [-1, 4096]               0
          Dropout-44                 [-1, 4096]               0
           Linear-45                 [-1, 1000]       4,097,000
================================================================
Total params: 143,667,240
Trainable params: 143,667,240
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 238.69
Params size (MB): 548.05
Estimated Total Size (MB): 787.31
----------------------------------------------------------------
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 64, 112, 112]           9,408
       BatchNorm2d-2         [-1, 64, 112, 112]             128
              ReLU-3         [-1, 64, 112, 112]               0
         MaxPool2d-4           [-1, 64, 56, 56]               0
            Conv2d-5           [-1, 64, 56, 56]           4,096
       BatchNorm2d-6           [-1, 64, 56, 56]             128
              ReLU-7           [-1, 64, 56, 56]               0
            Conv2d-8           [-1, 64, 56, 56]          36,864
       BatchNorm2d-9           [-1, 64, 56, 56]             128
             ReLU-10           [-1, 64, 56, 56]               0
           Conv2d-11          [-1, 256, 56, 56]          16,384
      BatchNorm2d-12          [-1, 256, 56, 56]             512
           Conv2d-13          [-1, 256, 56, 56]          16,384
      BatchNorm2d-14          [-1, 256, 56, 56]             512
             ReLU-15          [-1, 256, 56, 56]               0
       Bottleneck-16          [-1, 256, 56, 56]               0
           Conv2d-17           [-1, 64, 56, 56]          16,384
      BatchNorm2d-18           [-1, 64, 56, 56]             128
             ReLU-19           [-1, 64, 56, 56]               0
           Conv2d-20           [-1, 64, 56, 56]          36,864
      BatchNorm2d-21           [-1, 64, 56, 56]             128
             ReLU-22           [-1, 64, 56, 56]               0
           Conv2d-23          [-1, 256, 56, 56]          16,384
      BatchNorm2d-24          [-1, 256, 56, 56]             512
             ReLU-25          [-1, 256, 56, 56]               0
       Bottleneck-26          [-1, 256, 56, 56]               0
           Conv2d-27           [-1, 64, 56, 56]          16,384
      BatchNorm2d-28           [-1, 64, 56, 56]             128
             ReLU-29           [-1, 64, 56, 56]               0
           Conv2d-30           [-1, 64, 56, 56]          36,864
      BatchNorm2d-31           [-1, 64, 56, 56]             128
             ReLU-32           [-1, 64, 56, 56]               0
           Conv2d-33          [-1, 256, 56, 56]          16,384
      BatchNorm2d-34          [-1, 256, 56, 56]             512
             ReLU-35          [-1, 256, 56, 56]               0
       Bottleneck-36          [-1, 256, 56, 56]               0
           Conv2d-37          [-1, 128, 56, 56]          32,768
      BatchNorm2d-38          [-1, 128, 56, 56]             256
             ReLU-39          [-1, 128, 56, 56]               0
           Conv2d-40          [-1, 128, 28, 28]         147,456
      BatchNorm2d-41          [-1, 128, 28, 28]             256
             ReLU-42          [-1, 128, 28, 28]               0
           Conv2d-43          [-1, 512, 28, 28]          65,536
      BatchNorm2d-44          [-1, 512, 28, 28]           1,024
           Conv2d-45          [-1, 512, 28, 28]         131,072
      BatchNorm2d-46          [-1, 512, 28, 28]           1,024
             ReLU-47          [-1, 512, 28, 28]               0
       Bottleneck-48          [-1, 512, 28, 28]               0
           Conv2d-49          [-1, 128, 28, 28]          65,536
      BatchNorm2d-50          [-1, 128, 28, 28]             256
             ReLU-51          [-1, 128, 28, 28]               0
           Conv2d-52          [-1, 128, 28, 28]         147,456
      BatchNorm2d-53          [-1, 128, 28, 28]             256
             ReLU-54          [-1, 128, 28, 28]               0
           Conv2d-55          [-1, 512, 28, 28]          65,536
      BatchNorm2d-56          [-1, 512, 28, 28]           1,024
             ReLU-57          [-1, 512, 28, 28]               0
       Bottleneck-58          [-1, 512, 28, 28]               0
           Conv2d-59          [-1, 128, 28, 28]          65,536
      BatchNorm2d-60          [-1, 128, 28, 28]             256
             ReLU-61          [-1, 128, 28, 28]               0
           Conv2d-62          [-1, 128, 28, 28]         147,456
      BatchNorm2d-63          [-1, 128, 28, 28]             256
             ReLU-64          [-1, 128, 28, 28]               0
           Conv2d-65          [-1, 512, 28, 28]          65,536
      BatchNorm2d-66          [-1, 512, 28, 28]           1,024
             ReLU-67          [-1, 512, 28, 28]               0
       Bottleneck-68          [-1, 512, 28, 28]               0
           Conv2d-69          [-1, 128, 28, 28]          65,536
      BatchNorm2d-70          [-1, 128, 28, 28]             256
             ReLU-71          [-1, 128, 28, 28]               0
           Conv2d-72          [-1, 128, 28, 28]         147,456
      BatchNorm2d-73          [-1, 128, 28, 28]             256
             ReLU-74          [-1, 128, 28, 28]               0
           Conv2d-75          [-1, 512, 28, 28]          65,536
      BatchNorm2d-76          [-1, 512, 28, 28]           1,024
             ReLU-77          [-1, 512, 28, 28]               0
       Bottleneck-78          [-1, 512, 28, 28]               0
           Conv2d-79          [-1, 128, 28, 28]          65,536
      BatchNorm2d-80          [-1, 128, 28, 28]             256
             ReLU-81          [-1, 128, 28, 28]               0
           Conv2d-82          [-1, 128, 28, 28]         147,456
      BatchNorm2d-83          [-1, 128, 28, 28]             256
             ReLU-84          [-1, 128, 28, 28]               0
           Conv2d-85          [-1, 512, 28, 28]          65,536
      BatchNorm2d-86          [-1, 512, 28, 28]           1,024
             ReLU-87          [-1, 512, 28, 28]               0
       Bottleneck-88          [-1, 512, 28, 28]               0
           Conv2d-89          [-1, 128, 28, 28]          65,536
      BatchNorm2d-90          [-1, 128, 28, 28]             256
             ReLU-91          [-1, 128, 28, 28]               0
           Conv2d-92          [-1, 128, 28, 28]         147,456
      BatchNorm2d-93          [-1, 128, 28, 28]             256
             ReLU-94          [-1, 128, 28, 28]               0
           Conv2d-95          [-1, 512, 28, 28]          65,536
      BatchNorm2d-96          [-1, 512, 28, 28]           1,024
             ReLU-97          [-1, 512, 28, 28]               0
       Bottleneck-98          [-1, 512, 28, 28]               0
           Conv2d-99          [-1, 128, 28, 28]          65,536
     BatchNorm2d-100          [-1, 128, 28, 28]             256
            ReLU-101          [-1, 128, 28, 28]               0
          Conv2d-102          [-1, 128, 28, 28]         147,456
     BatchNorm2d-103          [-1, 128, 28, 28]             256
            ReLU-104          [-1, 128, 28, 28]               0
          Conv2d-105          [-1, 512, 28, 28]          65,536
     BatchNorm2d-106          [-1, 512, 28, 28]           1,024
            ReLU-107          [-1, 512, 28, 28]               0
      Bottleneck-108          [-1, 512, 28, 28]               0
          Conv2d-109          [-1, 128, 28, 28]          65,536
     BatchNorm2d-110          [-1, 128, 28, 28]             256
            ReLU-111          [-1, 128, 28, 28]               0
          Conv2d-112          [-1, 128, 28, 28]         147,456
     BatchNorm2d-113          [-1, 128, 28, 28]             256
            ReLU-114          [-1, 128, 28, 28]               0
          Conv2d-115          [-1, 512, 28, 28]          65,536
     BatchNorm2d-116          [-1, 512, 28, 28]           1,024
            ReLU-117          [-1, 512, 28, 28]               0
      Bottleneck-118          [-1, 512, 28, 28]               0
          Conv2d-119          [-1, 256, 28, 28]         131,072
     BatchNorm2d-120          [-1, 256, 28, 28]             512
            ReLU-121          [-1, 256, 28, 28]               0
          Conv2d-122          [-1, 256, 14, 14]         589,824
     BatchNorm2d-123          [-1, 256, 14, 14]             512
            ReLU-124          [-1, 256, 14, 14]               0
          Conv2d-125         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-126         [-1, 1024, 14, 14]           2,048
          Conv2d-127         [-1, 1024, 14, 14]         524,288
     BatchNorm2d-128         [-1, 1024, 14, 14]           2,048
            ReLU-129         [-1, 1024, 14, 14]               0
      Bottleneck-130         [-1, 1024, 14, 14]               0
          Conv2d-131          [-1, 256, 14, 14]         262,144
     BatchNorm2d-132          [-1, 256, 14, 14]             512
            ReLU-133          [-1, 256, 14, 14]               0
          Conv2d-134          [-1, 256, 14, 14]         589,824
     BatchNorm2d-135          [-1, 256, 14, 14]             512
            ReLU-136          [-1, 256, 14, 14]               0
          Conv2d-137         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-138         [-1, 1024, 14, 14]           2,048
            ReLU-139         [-1, 1024, 14, 14]               0
      Bottleneck-140         [-1, 1024, 14, 14]               0
          Conv2d-141          [-1, 256, 14, 14]         262,144
     BatchNorm2d-142          [-1, 256, 14, 14]             512
            ReLU-143          [-1, 256, 14, 14]               0
          Conv2d-144          [-1, 256, 14, 14]         589,824
     BatchNorm2d-145          [-1, 256, 14, 14]             512
            ReLU-146          [-1, 256, 14, 14]               0
          Conv2d-147         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-148         [-1, 1024, 14, 14]           2,048
            ReLU-149         [-1, 1024, 14, 14]               0
      Bottleneck-150         [-1, 1024, 14, 14]               0
          Conv2d-151          [-1, 256, 14, 14]         262,144
     BatchNorm2d-152          [-1, 256, 14, 14]             512
            ReLU-153          [-1, 256, 14, 14]               0
          Conv2d-154          [-1, 256, 14, 14]         589,824
     BatchNorm2d-155          [-1, 256, 14, 14]             512
            ReLU-156          [-1, 256, 14, 14]               0
          Conv2d-157         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-158         [-1, 1024, 14, 14]           2,048
            ReLU-159         [-1, 1024, 14, 14]               0
      Bottleneck-160         [-1, 1024, 14, 14]               0
          Conv2d-161          [-1, 256, 14, 14]         262,144
     BatchNorm2d-162          [-1, 256, 14, 14]             512
            ReLU-163          [-1, 256, 14, 14]               0
          Conv2d-164          [-1, 256, 14, 14]         589,824
     BatchNorm2d-165          [-1, 256, 14, 14]             512
            ReLU-166          [-1, 256, 14, 14]               0
          Conv2d-167         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-168         [-1, 1024, 14, 14]           2,048
            ReLU-169         [-1, 1024, 14, 14]               0
      Bottleneck-170         [-1, 1024, 14, 14]               0
          Conv2d-171          [-1, 256, 14, 14]         262,144
     BatchNorm2d-172          [-1, 256, 14, 14]             512
            ReLU-173          [-1, 256, 14, 14]               0
          Conv2d-174          [-1, 256, 14, 14]         589,824
     BatchNorm2d-175          [-1, 256, 14, 14]             512
            ReLU-176          [-1, 256, 14, 14]               0
          Conv2d-177         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-178         [-1, 1024, 14, 14]           2,048
            ReLU-179         [-1, 1024, 14, 14]               0
      Bottleneck-180         [-1, 1024, 14, 14]               0
          Conv2d-181          [-1, 256, 14, 14]         262,144
     BatchNorm2d-182          [-1, 256, 14, 14]             512
            ReLU-183          [-1, 256, 14, 14]               0
          Conv2d-184          [-1, 256, 14, 14]         589,824
     BatchNorm2d-185          [-1, 256, 14, 14]             512
            ReLU-186          [-1, 256, 14, 14]               0
          Conv2d-187         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-188         [-1, 1024, 14, 14]           2,048
            ReLU-189         [-1, 1024, 14, 14]               0
      Bottleneck-190         [-1, 1024, 14, 14]               0
          Conv2d-191          [-1, 256, 14, 14]         262,144
     BatchNorm2d-192          [-1, 256, 14, 14]             512
            ReLU-193          [-1, 256, 14, 14]               0
          Conv2d-194          [-1, 256, 14, 14]         589,824
     BatchNorm2d-195          [-1, 256, 14, 14]             512
            ReLU-196          [-1, 256, 14, 14]               0
          Conv2d-197         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-198         [-1, 1024, 14, 14]           2,048
            ReLU-199         [-1, 1024, 14, 14]               0
      Bottleneck-200         [-1, 1024, 14, 14]               0
          Conv2d-201          [-1, 256, 14, 14]         262,144
     BatchNorm2d-202          [-1, 256, 14, 14]             512
            ReLU-203          [-1, 256, 14, 14]               0
          Conv2d-204          [-1, 256, 14, 14]         589,824
     BatchNorm2d-205          [-1, 256, 14, 14]             512
            ReLU-206          [-1, 256, 14, 14]               0
          Conv2d-207         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-208         [-1, 1024, 14, 14]           2,048
            ReLU-209         [-1, 1024, 14, 14]               0
      Bottleneck-210         [-1, 1024, 14, 14]               0
          Conv2d-211          [-1, 256, 14, 14]         262,144
     BatchNorm2d-212          [-1, 256, 14, 14]             512
            ReLU-213          [-1, 256, 14, 14]               0
          Conv2d-214          [-1, 256, 14, 14]         589,824
     BatchNorm2d-215          [-1, 256, 14, 14]             512
            ReLU-216          [-1, 256, 14, 14]               0
          Conv2d-217         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-218         [-1, 1024, 14, 14]           2,048
            ReLU-219         [-1, 1024, 14, 14]               0
      Bottleneck-220         [-1, 1024, 14, 14]               0
          Conv2d-221          [-1, 256, 14, 14]         262,144
     BatchNorm2d-222          [-1, 256, 14, 14]             512
            ReLU-223          [-1, 256, 14, 14]               0
          Conv2d-224          [-1, 256, 14, 14]         589,824
     BatchNorm2d-225          [-1, 256, 14, 14]             512
            ReLU-226          [-1, 256, 14, 14]               0
          Conv2d-227         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-228         [-1, 1024, 14, 14]           2,048
            ReLU-229         [-1, 1024, 14, 14]               0
      Bottleneck-230         [-1, 1024, 14, 14]               0
          Conv2d-231          [-1, 256, 14, 14]         262,144
     BatchNorm2d-232          [-1, 256, 14, 14]             512
            ReLU-233          [-1, 256, 14, 14]               0
          Conv2d-234          [-1, 256, 14, 14]         589,824
     BatchNorm2d-235          [-1, 256, 14, 14]             512
            ReLU-236          [-1, 256, 14, 14]               0
          Conv2d-237         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-238         [-1, 1024, 14, 14]           2,048
            ReLU-239         [-1, 1024, 14, 14]               0
      Bottleneck-240         [-1, 1024, 14, 14]               0
          Conv2d-241          [-1, 256, 14, 14]         262,144
     BatchNorm2d-242          [-1, 256, 14, 14]             512
            ReLU-243          [-1, 256, 14, 14]               0
          Conv2d-244          [-1, 256, 14, 14]         589,824
     BatchNorm2d-245          [-1, 256, 14, 14]             512
            ReLU-246          [-1, 256, 14, 14]               0
          Conv2d-247         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-248         [-1, 1024, 14, 14]           2,048
            ReLU-249         [-1, 1024, 14, 14]               0
      Bottleneck-250         [-1, 1024, 14, 14]               0
          Conv2d-251          [-1, 256, 14, 14]         262,144
     BatchNorm2d-252          [-1, 256, 14, 14]             512
            ReLU-253          [-1, 256, 14, 14]               0
          Conv2d-254          [-1, 256, 14, 14]         589,824
     BatchNorm2d-255          [-1, 256, 14, 14]             512
            ReLU-256          [-1, 256, 14, 14]               0
          Conv2d-257         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-258         [-1, 1024, 14, 14]           2,048
            ReLU-259         [-1, 1024, 14, 14]               0
      Bottleneck-260         [-1, 1024, 14, 14]               0
          Conv2d-261          [-1, 256, 14, 14]         262,144
     BatchNorm2d-262          [-1, 256, 14, 14]             512
            ReLU-263          [-1, 256, 14, 14]               0
          Conv2d-264          [-1, 256, 14, 14]         589,824
     BatchNorm2d-265          [-1, 256, 14, 14]             512
            ReLU-266          [-1, 256, 14, 14]               0
          Conv2d-267         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-268         [-1, 1024, 14, 14]           2,048
            ReLU-269         [-1, 1024, 14, 14]               0
      Bottleneck-270         [-1, 1024, 14, 14]               0
          Conv2d-271          [-1, 256, 14, 14]         262,144
     BatchNorm2d-272          [-1, 256, 14, 14]             512
            ReLU-273          [-1, 256, 14, 14]               0
          Conv2d-274          [-1, 256, 14, 14]         589,824
     BatchNorm2d-275          [-1, 256, 14, 14]             512
            ReLU-276          [-1, 256, 14, 14]               0
          Conv2d-277         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-278         [-1, 1024, 14, 14]           2,048
            ReLU-279         [-1, 1024, 14, 14]               0
      Bottleneck-280         [-1, 1024, 14, 14]               0
          Conv2d-281          [-1, 256, 14, 14]         262,144
     BatchNorm2d-282          [-1, 256, 14, 14]             512
            ReLU-283          [-1, 256, 14, 14]               0
          Conv2d-284          [-1, 256, 14, 14]         589,824
     BatchNorm2d-285          [-1, 256, 14, 14]             512
            ReLU-286          [-1, 256, 14, 14]               0
          Conv2d-287         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-288         [-1, 1024, 14, 14]           2,048
            ReLU-289         [-1, 1024, 14, 14]               0
      Bottleneck-290         [-1, 1024, 14, 14]               0
          Conv2d-291          [-1, 256, 14, 14]         262,144
     BatchNorm2d-292          [-1, 256, 14, 14]             512
            ReLU-293          [-1, 256, 14, 14]               0
          Conv2d-294          [-1, 256, 14, 14]         589,824
     BatchNorm2d-295          [-1, 256, 14, 14]             512
            ReLU-296          [-1, 256, 14, 14]               0
          Conv2d-297         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-298         [-1, 1024, 14, 14]           2,048
            ReLU-299         [-1, 1024, 14, 14]               0
      Bottleneck-300         [-1, 1024, 14, 14]               0
          Conv2d-301          [-1, 256, 14, 14]         262,144
     BatchNorm2d-302          [-1, 256, 14, 14]             512
            ReLU-303          [-1, 256, 14, 14]               0
          Conv2d-304          [-1, 256, 14, 14]         589,824
     BatchNorm2d-305          [-1, 256, 14, 14]             512
            ReLU-306          [-1, 256, 14, 14]               0
          Conv2d-307         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-308         [-1, 1024, 14, 14]           2,048
            ReLU-309         [-1, 1024, 14, 14]               0
      Bottleneck-310         [-1, 1024, 14, 14]               0
          Conv2d-311          [-1, 256, 14, 14]         262,144
     BatchNorm2d-312          [-1, 256, 14, 14]             512
            ReLU-313          [-1, 256, 14, 14]               0
          Conv2d-314          [-1, 256, 14, 14]         589,824
     BatchNorm2d-315          [-1, 256, 14, 14]             512
            ReLU-316          [-1, 256, 14, 14]               0
          Conv2d-317         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-318         [-1, 1024, 14, 14]           2,048
            ReLU-319         [-1, 1024, 14, 14]               0
      Bottleneck-320         [-1, 1024, 14, 14]               0
          Conv2d-321          [-1, 256, 14, 14]         262,144
     BatchNorm2d-322          [-1, 256, 14, 14]             512
            ReLU-323          [-1, 256, 14, 14]               0
          Conv2d-324          [-1, 256, 14, 14]         589,824
     BatchNorm2d-325          [-1, 256, 14, 14]             512
            ReLU-326          [-1, 256, 14, 14]               0
          Conv2d-327         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-328         [-1, 1024, 14, 14]           2,048
            ReLU-329         [-1, 1024, 14, 14]               0
      Bottleneck-330         [-1, 1024, 14, 14]               0
          Conv2d-331          [-1, 256, 14, 14]         262,144
     BatchNorm2d-332          [-1, 256, 14, 14]             512
            ReLU-333          [-1, 256, 14, 14]               0
          Conv2d-334          [-1, 256, 14, 14]         589,824
     BatchNorm2d-335          [-1, 256, 14, 14]             512
            ReLU-336          [-1, 256, 14, 14]               0
          Conv2d-337         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-338         [-1, 1024, 14, 14]           2,048
            ReLU-339         [-1, 1024, 14, 14]               0
      Bottleneck-340         [-1, 1024, 14, 14]               0
          Conv2d-341          [-1, 256, 14, 14]         262,144
     BatchNorm2d-342          [-1, 256, 14, 14]             512
            ReLU-343          [-1, 256, 14, 14]               0
          Conv2d-344          [-1, 256, 14, 14]         589,824
     BatchNorm2d-345          [-1, 256, 14, 14]             512
            ReLU-346          [-1, 256, 14, 14]               0
          Conv2d-347         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-348         [-1, 1024, 14, 14]           2,048
            ReLU-349         [-1, 1024, 14, 14]               0
      Bottleneck-350         [-1, 1024, 14, 14]               0
          Conv2d-351          [-1, 256, 14, 14]         262,144
     BatchNorm2d-352          [-1, 256, 14, 14]             512
            ReLU-353          [-1, 256, 14, 14]               0
          Conv2d-354          [-1, 256, 14, 14]         589,824
     BatchNorm2d-355          [-1, 256, 14, 14]             512
            ReLU-356          [-1, 256, 14, 14]               0
          Conv2d-357         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-358         [-1, 1024, 14, 14]           2,048
            ReLU-359         [-1, 1024, 14, 14]               0
      Bottleneck-360         [-1, 1024, 14, 14]               0
          Conv2d-361          [-1, 256, 14, 14]         262,144
     BatchNorm2d-362          [-1, 256, 14, 14]             512
            ReLU-363          [-1, 256, 14, 14]               0
          Conv2d-364          [-1, 256, 14, 14]         589,824
     BatchNorm2d-365          [-1, 256, 14, 14]             512
            ReLU-366          [-1, 256, 14, 14]               0
          Conv2d-367         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-368         [-1, 1024, 14, 14]           2,048
            ReLU-369         [-1, 1024, 14, 14]               0
      Bottleneck-370         [-1, 1024, 14, 14]               0
          Conv2d-371          [-1, 256, 14, 14]         262,144
     BatchNorm2d-372          [-1, 256, 14, 14]             512
            ReLU-373          [-1, 256, 14, 14]               0
          Conv2d-374          [-1, 256, 14, 14]         589,824
     BatchNorm2d-375          [-1, 256, 14, 14]             512
            ReLU-376          [-1, 256, 14, 14]               0
          Conv2d-377         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-378         [-1, 1024, 14, 14]           2,048
            ReLU-379         [-1, 1024, 14, 14]               0
      Bottleneck-380         [-1, 1024, 14, 14]               0
          Conv2d-381          [-1, 256, 14, 14]         262,144
     BatchNorm2d-382          [-1, 256, 14, 14]             512
            ReLU-383          [-1, 256, 14, 14]               0
          Conv2d-384          [-1, 256, 14, 14]         589,824
     BatchNorm2d-385          [-1, 256, 14, 14]             512
            ReLU-386          [-1, 256, 14, 14]               0
          Conv2d-387         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-388         [-1, 1024, 14, 14]           2,048
            ReLU-389         [-1, 1024, 14, 14]               0
      Bottleneck-390         [-1, 1024, 14, 14]               0
          Conv2d-391          [-1, 256, 14, 14]         262,144
     BatchNorm2d-392          [-1, 256, 14, 14]             512
            ReLU-393          [-1, 256, 14, 14]               0
          Conv2d-394          [-1, 256, 14, 14]         589,824
     BatchNorm2d-395          [-1, 256, 14, 14]             512
            ReLU-396          [-1, 256, 14, 14]               0
          Conv2d-397         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-398         [-1, 1024, 14, 14]           2,048
            ReLU-399         [-1, 1024, 14, 14]               0
      Bottleneck-400         [-1, 1024, 14, 14]               0
          Conv2d-401          [-1, 256, 14, 14]         262,144
     BatchNorm2d-402          [-1, 256, 14, 14]             512
            ReLU-403          [-1, 256, 14, 14]               0
          Conv2d-404          [-1, 256, 14, 14]         589,824
     BatchNorm2d-405          [-1, 256, 14, 14]             512
            ReLU-406          [-1, 256, 14, 14]               0
          Conv2d-407         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-408         [-1, 1024, 14, 14]           2,048
            ReLU-409         [-1, 1024, 14, 14]               0
      Bottleneck-410         [-1, 1024, 14, 14]               0
          Conv2d-411          [-1, 256, 14, 14]         262,144
     BatchNorm2d-412          [-1, 256, 14, 14]             512
            ReLU-413          [-1, 256, 14, 14]               0
          Conv2d-414          [-1, 256, 14, 14]         589,824
     BatchNorm2d-415          [-1, 256, 14, 14]             512
            ReLU-416          [-1, 256, 14, 14]               0
          Conv2d-417         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-418         [-1, 1024, 14, 14]           2,048
            ReLU-419         [-1, 1024, 14, 14]               0
      Bottleneck-420         [-1, 1024, 14, 14]               0
          Conv2d-421          [-1, 256, 14, 14]         262,144
     BatchNorm2d-422          [-1, 256, 14, 14]             512
            ReLU-423          [-1, 256, 14, 14]               0
          Conv2d-424          [-1, 256, 14, 14]         589,824
     BatchNorm2d-425          [-1, 256, 14, 14]             512
            ReLU-426          [-1, 256, 14, 14]               0
          Conv2d-427         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-428         [-1, 1024, 14, 14]           2,048
            ReLU-429         [-1, 1024, 14, 14]               0
      Bottleneck-430         [-1, 1024, 14, 14]               0
          Conv2d-431          [-1, 256, 14, 14]         262,144
     BatchNorm2d-432          [-1, 256, 14, 14]             512
            ReLU-433          [-1, 256, 14, 14]               0
          Conv2d-434          [-1, 256, 14, 14]         589,824
     BatchNorm2d-435          [-1, 256, 14, 14]             512
            ReLU-436          [-1, 256, 14, 14]               0
          Conv2d-437         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-438         [-1, 1024, 14, 14]           2,048
            ReLU-439         [-1, 1024, 14, 14]               0
      Bottleneck-440         [-1, 1024, 14, 14]               0
          Conv2d-441          [-1, 256, 14, 14]         262,144
     BatchNorm2d-442          [-1, 256, 14, 14]             512
            ReLU-443          [-1, 256, 14, 14]               0
          Conv2d-444          [-1, 256, 14, 14]         589,824
     BatchNorm2d-445          [-1, 256, 14, 14]             512
            ReLU-446          [-1, 256, 14, 14]               0
          Conv2d-447         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-448         [-1, 1024, 14, 14]           2,048
            ReLU-449         [-1, 1024, 14, 14]               0
      Bottleneck-450         [-1, 1024, 14, 14]               0
          Conv2d-451          [-1, 256, 14, 14]         262,144
     BatchNorm2d-452          [-1, 256, 14, 14]             512
            ReLU-453          [-1, 256, 14, 14]               0
          Conv2d-454          [-1, 256, 14, 14]         589,824
     BatchNorm2d-455          [-1, 256, 14, 14]             512
            ReLU-456          [-1, 256, 14, 14]               0
          Conv2d-457         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-458         [-1, 1024, 14, 14]           2,048
            ReLU-459         [-1, 1024, 14, 14]               0
      Bottleneck-460         [-1, 1024, 14, 14]               0
          Conv2d-461          [-1, 256, 14, 14]         262,144
     BatchNorm2d-462          [-1, 256, 14, 14]             512
            ReLU-463          [-1, 256, 14, 14]               0
          Conv2d-464          [-1, 256, 14, 14]         589,824
     BatchNorm2d-465          [-1, 256, 14, 14]             512
            ReLU-466          [-1, 256, 14, 14]               0
          Conv2d-467         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-468         [-1, 1024, 14, 14]           2,048
            ReLU-469         [-1, 1024, 14, 14]               0
      Bottleneck-470         [-1, 1024, 14, 14]               0
          Conv2d-471          [-1, 256, 14, 14]         262,144
     BatchNorm2d-472          [-1, 256, 14, 14]             512
            ReLU-473          [-1, 256, 14, 14]               0
          Conv2d-474          [-1, 256, 14, 14]         589,824
     BatchNorm2d-475          [-1, 256, 14, 14]             512
            ReLU-476          [-1, 256, 14, 14]               0
          Conv2d-477         [-1, 1024, 14, 14]         262,144
     BatchNorm2d-478         [-1, 1024, 14, 14]           2,048
            ReLU-479         [-1, 1024, 14, 14]               0
      Bottleneck-480         [-1, 1024, 14, 14]               0
          Conv2d-481          [-1, 512, 14, 14]         524,288
     BatchNorm2d-482          [-1, 512, 14, 14]           1,024
            ReLU-483          [-1, 512, 14, 14]               0
          Conv2d-484            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-485            [-1, 512, 7, 7]           1,024
            ReLU-486            [-1, 512, 7, 7]               0
          Conv2d-487           [-1, 2048, 7, 7]       1,048,576
     BatchNorm2d-488           [-1, 2048, 7, 7]           4,096
          Conv2d-489           [-1, 2048, 7, 7]       2,097,152
     BatchNorm2d-490           [-1, 2048, 7, 7]           4,096
            ReLU-491           [-1, 2048, 7, 7]               0
      Bottleneck-492           [-1, 2048, 7, 7]               0
          Conv2d-493            [-1, 512, 7, 7]       1,048,576
     BatchNorm2d-494            [-1, 512, 7, 7]           1,024
            ReLU-495            [-1, 512, 7, 7]               0
          Conv2d-496            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-497            [-1, 512, 7, 7]           1,024
            ReLU-498            [-1, 512, 7, 7]               0
          Conv2d-499           [-1, 2048, 7, 7]       1,048,576
     BatchNorm2d-500           [-1, 2048, 7, 7]           4,096
            ReLU-501           [-1, 2048, 7, 7]               0
      Bottleneck-502           [-1, 2048, 7, 7]               0
          Conv2d-503            [-1, 512, 7, 7]       1,048,576
     BatchNorm2d-504            [-1, 512, 7, 7]           1,024
            ReLU-505            [-1, 512, 7, 7]               0
          Conv2d-506            [-1, 512, 7, 7]       2,359,296
     BatchNorm2d-507            [-1, 512, 7, 7]           1,024
            ReLU-508            [-1, 512, 7, 7]               0
          Conv2d-509           [-1, 2048, 7, 7]       1,048,576
     BatchNorm2d-510           [-1, 2048, 7, 7]           4,096
            ReLU-511           [-1, 2048, 7, 7]               0
      Bottleneck-512           [-1, 2048, 7, 7]               0
AdaptiveAvgPool2d-513           [-1, 2048, 1, 1]               0
          Linear-514                 [-1, 1000]       2,049,000
================================================================
Total params: 60,192,808
Trainable params: 60,192,808
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 606.59
Params size (MB): 229.62
Estimated Total Size (MB): 836.78
----------------------------------------------------------------
